Revit 2027 API
BuiltInFailures.SiteFailures.NotEnoughPointsInSurface Property
 The surface must have at least three distinct Points.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotEnoughPointsInSurface { get; }
Public Shared ReadOnly Property NotEnoughPointsInSurface As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotEnoughPointsInSurface {
	FailureDefinitionId^ get ();
}
static member NotEnoughPointsInSurface : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace